---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelMainstypeParam
source: html/f98cd4b1-b488-8606-963f-596cae72ae32.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelMainstypeParam Property

"Mains Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelMainstypeParam { get; }
```